{
  "keyanshu.gariba@gmail.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's student in Software Engineering at Northeastern University with a strong background in full-stack development and scalable systems. I was excited to come across the opportunity at craz7, as my skills align closely with your requirements.<br><br>  \nWith experience in Flutter (Dart), React.js, Node.js, and backend development using Spring Boot, I’ve built cross-platform applications and optimized databases like PostgreSQL and MongoDB. At Creomutus Designs, I developed a unified database system using Java and REST APIs, reducing redundancy by 40%. Additionally, my work on the MERN-based \"Luggshare\" platform demonstrates my ability to build scalable web and mobile solutions.<br><br>  \nI’d love the chance to contribute to your mission of revolutionizing civic tech. Thank you for your time and consideration. Looking forward to connecting further.",
  "vishvesh@gmail.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a graduate student at Northeastern University (Boston campus), set to graduate this May.<br><br>\n    With a strong background in software engineering, including Full Stack Development, Database Management, and Generative AI, I am eager to apply my skills and knowledge in a professional setting at nonsense Goat.<br><br>\n    I would greatly appreciate your consideration for any open Software Development or Data Engineering positions within your organization. I have attached my resume for your reference and would be happy to provide any additional information if needed.<br><br>\n    Thank you for your time and consideration. I look forward to the opportunity to connect.",
  "sonetah@gmail.com": "I hope this email finds you well. My name is Kenshu Gariba, and I am a Master's student in Software Engineering at Northeastern University with a strong background in full-stack development and scalable systems. I came across the opportunity at Nonsense and was excited to see the alignment with my skills.<br><br>  \nWith 1.5 years of hands-on experience in Flutter (Dart), React, Node.js, and Spring Boot, I’ve built cross-platform mobile apps, optimized backend systems, and designed RESTful APIs—matching your tech stack needs. My work at Creomutus Designs involved reducing data redundancy by 40% using Spring Boot, and I’ve deployed scalable databases like PostgreSQL and MongoDB. I thrive in agile environments and am passionate about civic tech’s social impact.<br><br>  \nI’d love to contribute to your mission. Thank you for your time and consideration. Looking forward to connecting!"
}