{
  "keyanshu.gariba@gmail.com": "I hope this email finds you well. My name is Naughty, and I am a Master's student in Software Engineering at Northeastern University with a strong background in full-stack development and scalable systems. I’m excited about the opportunity to join craz7 as a Full-Stack Developer, given my experience with Flutter (Dart), React, Node.js, and RESTful APIs, as well as my work optimizing databases like MySQL and MongoDB.<br><br>  \nAt Creomutus Designs, I built a unified database system using Spring Boot, cutting redundancy by 40%, and at TechEniac, I developed responsive front-end interfaces, improving user engagement by 30%. My projects, like the MERN-based Luggshare platform, further demonstrate my ability to build scalable applications. I’d love to contribute my skills to your mission of revolutionizing civic tech.<br><br>  \nThank you for your time I’d welcome the chance to discuss how I can add value to your team.",
  "sonetah@gmail.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's student in Software Engineering at Northeastern University with a strong background in full-stack development and scalable systems. I came across the opportunity at Nonsense and was excited to see the alignment with my skills in Flutter (Dart), React.js, Node.js, and backend development using Spring Boot and Python.<br><br>  \nMy experience at Creomutus Designs, where I built a unified database system using MySQL and Spring Boot, along with optimizing APIs, directly relates to your need for scalable backend solutions. Additionally, my work on cross-platform applications like Luggshare (MERN stack) and process scheduling visualization tools demonstrates my ability to deliver performant, user-centric solutions.<br><br>  \nI’d love to contribute my expertise in civic tech and would appreciate the chance to discuss how my skills align with your mission. Thank you for your time and consideration.",
  "vishvesh@gmail.com": "<br><br>  \nI hope this email finds you well. My name is Keyanshu Gariba, and I am excited to apply for the Full-Stack Developer role at Nonsense Goat. With my experience in Flutter (Dart), React, Node.js, and backend development using Spring Boot and Python, I am confident in my ability to contribute to your mission of revolutionizing civic engagement. My work at Creomutus Designs, where I built scalable database systems and RESTful APIs, aligns well with your need for seamless frontend-backend integration. Additionally, my projects, like the MERN-based Luggshare platform, demonstrate my proficiency in cross-platform development and cloud deployment. I’d love the opportunity to discuss how my skills can support your team’s goals.<br><br>  \nThank you for your time and consideration. I look forward to hearing from you."
}