{"richard.raymond@aura.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's student in Software Engineering at Northeastern University (Boston), graduating in 2025 with a 4.0 GPA. I’m excited to apply for the Backend Software Engineer role at Aura, as my skills align closely with your requirements.<br><br>  \nWith strong Python expertise, I’ve built scalable systems using Spring Boot, REST APIs, and AWS, reducing data redundancy by 40% in a prior internship. My experience with Git workflows, Terraform, and GitHub Actions matches your infrastructure-as-code needs. Additionally, my projects—like fine-tuning CLIP for text-to-image generation and deploying ML models with PyTorch—reflect my passion for AI/ML integrations, a key focus for your team.<br><br>  \nI’d love to contribute to your Insights and Alerts team and welcome the chance to discuss further. Thank you for your time and consideration.", "michelle.ricker@pango.co": "\n    Dear Michelle,<br><br>\n    I hope this email finds you well. My name is Keyanshu Gariba, and I am a graduate student at Northeastern University (Boston campus), set to graduate this May.<br><br>\n    With a strong background in software engineering, including Full Stack Development, Database Management, and Generative AI, I am eager to apply my skills and knowledge in a professional setting at Pango.<br><br>\n    I would greatly appreciate your consideration for any open Software Development or Data Engineering positions within your organization. I have attached my resume for your reference and would be happy to provide any additional information if needed.<br><br>\n    Thank you for your time and consideration. I look forward to the opportunity to connect.\n    ", "courtney.fay@snyk.io": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's student in Software Engineering Systems at Northeastern University with a strong passion for building scalable, high-performance systems. With 5+ years of experience in software engineering, including full-stack development, microservices, and database optimization, I am excited about the opportunity to contribute to Snyk's mission in application security.<br><br>  \nMy expertise aligns closely with Snyk's needs—I’ve built large-scale systems like an Automobile Manufacturing DBMS (reducing data retrieval by 27%) and optimized microservices using Spring Boot and REST APIs. Proficient in Python, Java, and JavaScript (React/Node), I also bring experience in mentoring peers and leading projects end-to-end. I’d love to discuss how my skills in scalable architecture and problem-solving can support Snyk’s engineering teams.<br><br>  \nThank you for your time and consideration—I’d welcome the chance to explore this opportunity further.", "ryan.okeefe@snyk.io": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's candidate in Software Engineering Systems at Northeastern University with a 4.0 GPA. I am excited about the Software Engineer opportunity at Snyk, where I can leverage my 2+ years of experience in building scalable systems and solving complex problems.<br><br>  \nMy work at Creomotus Designs involved designing a high-efficiency database management system using Java and Spring Boot, reducing redundancy by 40% and streamlining operations—aligning with Snyk’s need for robust, scalable solutions. Additionally, I’ve built full-stack applications (MERN stack) and optimized process scheduling algorithms, demonstrating proficiency in system design and performance tuning. My expertise in Python, Go (via coursework), and microservices architecture, coupled with a passion for mentorship, matches Snyk’s focus on innovation and team growth.<br><br>  \nI’d welcome the chance to discuss how my skills can contribute to Snyk’s mission. Thank you for your time and consideration.", "lauren.murphy@snyk.io": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's student in Software Engineering Systems at Northeastern University with a strong passion for building scalable, high-performance systems. With 5+ years of experience in software development, including designing large-scale database systems and full-stack applications, I am excited about the opportunity to contribute to Snyk’s mission in application security.<br><br>  \nMy expertise aligns closely with Snyk’s needs, including proficiency in Java, Python, and JavaScript (React/Node), building microservices with Spring Boot, and optimizing systems for reliability and scalability. At Creomotus Designs, I reduced data redundancy by 40% through innovative database solutions, and my work on AWS-backed DBMS improved production efficiency by 15%. I thrive in collaborative environments and have mentored peers through code reviews and Agile practices.<br><br>  \nI would love the chance to discuss how my skills can support Snyk’s engineering goals. Thank you for your time and consideration.", "robert.reardon@snyk.io": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's candidate in Software Engineering Systems at Northeastern University with a 4.0 GPA. I am excited about the Software Engineer opportunity at Snyk, where I can leverage my 2+ years of experience in building scalable systems, microservices, and full-stack applications.<br><br>  \nMy work at Creomutus Designs involved designing a high-efficiency database management system using Java and Spring Boot, reducing redundancy by 40% while improving data accessibility. Additionally, I developed a text-to-image generation model using PyTorch and TensorFlow, demonstrating my ability to tackle complex problems with innovative solutions. My proficiency in JavaScript, React, and cloud technologies (AWS) aligns well with Snyk’s focus on robust, scalable systems.<br><br>  \nI’d welcome the chance to discuss how my skills in software design, mentorship, and agile development could contribute to Snyk’s mission. Thank you for your time and consideration."}