{"keyanshu.gariba@gmail.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's student in Software Engineering at Northeastern University with a strong passion for building scalable, impactful tech solutions. I was excited to come across the Full-Stack Developer role at craz7, as my skills align closely with your requirements.<br><br>  \nWith experience in Flutter (Dart), React, Node.js, and backend development using Spring Boot, I’ve built cross-platform applications like Luggshare (MERN stack) and optimized databases (PostgreSQL, MongoDB) to improve efficiency by 30-40%. My work at Creomotus Designs involved streamlining operations via REST APIs and automated systems, directly mirroring the scalability challenges your startup tackles. I’d love to contribute my expertise in civic tech and agile development to your mission.<br><br>  \nThank you for your time—I’d welcome the chance to discuss how I can support craz7’s vision.", "sonetah@gmail.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's student in Software Engineering at Northeastern University with a strong background in full-stack development and scalable systems. I came across the opportunity at Nonsense and was excited to see the alignment with my skills in Flutter (Dart), React.js, Node.js, and backend development using Spring Boot and Python.<br><br>  \nDuring my internships, I built cross-platform applications, optimized databases (PostgreSQL, MongoDB), and deployed scalable solutions using AWS—directly matching your needs. My experience in RESTful APIs, CI/CD pipelines, and agile development would allow me to contribute immediately to your mission of revolutionizing civic tech.<br><br>  \nI’d love the chance to discuss how my background fits your vision. Thank you for your time and consideration.", "vishvesh@gmail.com": "\n    Dear hitesh,<br><br>\n    I hope this email finds you well. My name is Keyanshu Gariba, and I am a graduate student at Northeastern University (Boston campus), set to graduate this May.<br><br>\n    With a strong background in software engineering, including Full Stack Development, Database Management, and Generative AI, I am eager to apply my skills and knowledge in a professional setting at nonsense Goat.<br><br>\n    I would greatly appreciate your consideration for any open Software Development or Data Engineering positions within your organization. I have attached my resume for your reference and would be happy to provide any additional information if needed.<br><br>\n    Thank you for your time and consideration. I look forward to the opportunity to connect.\n    "}