{"keyanshu.gariba@gmail.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's candidate in Software Engineering Systems at Northeastern University, graduating in April 2025. With two years of programming experience and expertise in React, Node.js, AWS, and database management, I am excited about the Software Engineer II role at Travelers.<br><br>  \nMy experience aligns with your ideal candidate profile, including developing web applications with React and Node.js, optimizing database systems (reducing errors by 30%), and leading projects like Luggshare (MERN stack). I thrive in collaborative environments and have a proven track record in problem-solving and agile methodologies.<br><br>  \nI would appreciate the opportunity to contribute to Travelers' innovative culture. Thank you for your time and consideration.", "sonetah@gmail.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's candidate in Software Engineering Systems at Northeastern University with a 4.0 GPA. I am excited to apply for the Software Engineer role at BioTechne, where my expertise in C#, JavaScript, Python, and regulated software development aligns perfectly with the job requirements.<br><br>  \nMy experience includes developing commercial-grade applications using Agile methodologies, cloud-native tools (AWS), and frameworks like React and Spring Boot. At Creomotus Designs, I designed a database system that reduced errors by 30%, showcasing my problem-solving skills. Additionally, my work with PyTorch and TensorFlow in GenAI projects demonstrates my ability to innovate in bioinformatics and diagnostics.<br><br>  \nI would appreciate the opportunity to contribute to Asuragen’s mission. Thank you for your time and consideration.", "vishveshpanchal101@gmail.com": "<br><br>  \nI hope this email finds you well. My name is Keyanshu Gariba, and I am a Master's candidate in Software Engineering Systems at Northeastern University with a 4.0 GPA. With expertise in JavaScript, Python, and cloud-native development (AWS), along with experience in Agile methodologies and regulated software tools (Git, Jira), I am excited about the Software Engineer role at Asuragen, a Bio-Techne brand.<br><br>  \nMy background aligns closely with the job requirements, including developing scalable web applications (MERN stack), optimizing databases (MySQL, NoSQL), and implementing secure, tested software (unit/integration tests). At Creomotus, I reduced data redundancy by 40% using Spring Boot and REST APIs, demonstrating my problem-solving skills in cross-functional teams.<br><br>  \nI would welcome the opportunity to contribute to your mission in molecular diagnostics. Thank you for your time and consideration."}