{"keyanshu.gariba@gmail.com": "I hope this email finds you well. My name is Keyanshu Gariba, and I am excited to apply for the Full-Stack Developer role at Company. With 3+ years of experience in Flutter (Dart) and cross-platform mobile development, along with expertise in Node.js, React.js, and RESTful APIs, I am confident in my ability to contribute to your mission of revolutionizing civic engagement.<br><br>  \nMy background includes building scalable backend systems with PostgreSQL and Firebase, deploying apps via Docker/AWS, and collaborating in agile environments. I am particularly drawn to this opportunity as it aligns with my passion for leveraging technology for social impact.<br><br>  \nI would appreciate the chance to discuss how my skills match your needs. Thank you for your time and consideration.", "sonetah@gmail.com": "<br><br>  \nI hope this email finds you well. My name is [Your Name], and I am excited to apply for the full-stack developer role at Company. With [X] years of experience in Flutter (Dart), React.js, and backend development using Node.js and Python, I have built scalable mobile and web applications, optimized RESTful APIs, and deployed solutions on AWS. My work aligns closely with your mission to enhance civic engagement through technology, and I thrive in fast-paced startup environments.<br><br>  \nI’d appreciate the opportunity to contribute my skills in cross-platform development, database integration, and cloud deployment to your team. Thank you for your time—I’d welcome a chance to discuss further.", "vishvesh@gmail.com": "<br><br>  \nI hope this email finds you well. My name is Keyanshu Gariba, and I am excited to apply for the Full-Stack Developer role at Nonsense Goat. With my experience in Flutter (Dart), React.js, Node.js, and backend development using Spring Boot and Python, I am confident in my ability to contribute to your mission of revolutionizing civic engagement.<br><br>  \n\nMy work at Creomutus Designs involved building scalable backend systems with REST APIs and optimizing databases (MySQL, PostgreSQL), while my projects like Luggshare demonstrate my proficiency in the MERN stack. Additionally, my expertise in CI/CD (GitHub Actions, Jenkins) and cloud deployment (AWS) aligns well with your technical needs.<br><br>  \n\nI’d love the opportunity to discuss how my skills can support your team. Thank you for your time and consideration."}