[{"Name":"keyanshu.gariba","Email":"keyanshu.gariba@gmail.com","Company":"Company","JobDescription":"Who Are We?\r\n\r\nTaking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it.\r\n\r\nCompensation Overview\r\n\r\nThe annual base salary range provided for this position is a nationwide market range and represents a broad range of salaries for this role across the country. The actual salary for this position will be determined by a number of factors, including the scope, complexity and location of the role; the skills, education, training, credentials and experience of the candidate; and other conditions of employment. As part of our comprehensive compensation and benefits program, employees are also eligible for performance-based cash incentive awards.\r\n\r\nSalary Range\r\n\r\n$117,200.00 - $193,400.00\r\n\r\nTarget Openings\r\n\r\n1\r\n\r\nWhat Is the Opportunity?\r\n\r\nTravelers is seeking a Software Engineer II to join our organization as we grow and transform our Technology landscape. Individual will complete advanced end to end engineering tasks for specific system assignments including designing, developing, analyzing, configuring, testing, debugging, troubleshooting, documenting, health monitoring/alerting, and implementing based on user or system specifications, consulting with users to determine hardware, software or system functional specifications, managing interaction between the systems and other technical support areas and defining technical requirements and coordinating team resources to solve problems.\r\n\r\nWhat Will You Do?\r\n\r\nPerform analysis, design, development, and configuration functions (includes defining technical requirements) with a high degree of accuracy and speed, operating as an individual contributor to team goals.\r\nPerform analysis, assessment and resolution for defects and incidents of advanced complexity and escalate appropriately.\r\nWork independently to tackle well-scoped and loosely scoped problems.\r\nSeek opportunities to expand technical knowledge and capabilities.\r\nProvide technical guidance and mentorship to less experienced employees.\r\nPerform other duties as assigned. \r\n\r\nWhat Will Our Ideal Candidate Have?\r\n\r\nFour years of programming/development experience preferred.\r\nExperience developing web and mobile applications with React, React Native, Node.js, AWS.\r\nDelivery - Intermediate delivery skills including the ability to estimate accurate timelines for tasks and deliver work at a steady, predictable pace to achieve commitments, contribute to the software design strategy and methodologies used to best meet the system requirements, consider and build for many different use cases, avoid over engineering, and ensure automation, deliver complete solutions but release them in small batches, and identify important tradeoffs and negotiate them.\r\nDomain Expertise - Demonstrated track record of domain expertise including understanding technical concepts necessary to do the job effectively and aware of industry trends, demonstrate willingness, cooperation, and concern for business issues and priorities, and possess in depth knowledge of immediate systems worked on and some knowledge of adjacent systems.\r\nProblem Solving - Strong problem solver who ensures solutions are built for the long term, is able to resolve new issues, recognizes mistakes using them as learning and teaching opportunities and consistently breaks down large problems into smaller, more manageable ones.\r\nCommunication - Strong communicator who possesses the ability to articulate information clearly and concisely with the business, document work in a clear, easy to follow manner, collaborate well with team members as both a mentor and mentee, take in vague requirements and ask the right questions to ensure clarification, offer feedback appropriately and effectively, seek out and receives constructive criticism well, listen when others are speaking and make space for colleagues to share their thoughts.\r\nLeadership - Intermediate leadership skills with the ability to help create a safe environment for others to learn and grow as engineers and a proven track record of self-motivation in identifying opportunities and tracking team efforts.\r\n\r\nWhat is a Must Have?\r\n\r\nBachelor’s degree or its equivalent in work experience.\r\nTwo years of programming/development experience.\r\n\r\nWhat Is in It for You?\r\n\r\nHealth Insurance: Employees and their eligible family members – including spouses, domestic partners, and children – are eligible for coverage from the first day of employment.\r\nRetirement: Travelers matches your 401(k) contributions dollar-for-dollar up to your first 5% of eligible pay, subject to an annual maximum. If you have student loan debt, you can enroll in the Paying it Forward Savings Program. When you make a payment toward your student loan, Travelers will make an annual contribution into your 401(k) account. You are also eligible for a Pension Plan that is 100% funded by Travelers.\r\nPaid Time Off: Start your career at Travelers with a minimum of 20 days Paid Time Off annually, plus nine paid company Holidays.\r\nWellness Program: The Travelers wellness program is comprised of tools, discounts and resources that empower you to achieve your wellness goals and caregiving needs. In addition, our mental health program provides access to free professional counseling services, health coaching and other resources to support your daily life needs.\r\nVolunteer Encouragement: We have a deep commitment to the communities we serve and encourage our employees to get involved. Travelers has a Matching Gift and Volunteer Rewards program that enables you to give back to the charity of your choice."}]